app/views/main/charts.html.erb

		        duration: 500
		    },
            series: [
            <% @team_data.each_with_index do |t, i| %>{
                id: '<%= t.abbr %>',
                type: 'pie',
                data:[
                <% t.contracts.year(params[:year]).each_with_index do |c, ix| %>
                	["<%== c.player.name%>", <%=c.salary.floor%>]<% if ix != t.contracts.size - 1 %>,<% end %>
                    <% end %>
                    ]

            }<% if i != @team_data.size - 1 %>,<% end %>
            <%end%>
            ]
---
SELECT  "players".* FROM "players"  WHERE "players"."id" = $1 LIMIT 1  [["id", 1673]]