app/views/main/league_chart.html.erb

SELECT "contracts".* FROM "contracts"  WHERE "contracts"."team_id" = $1 AND (year IN ('2014-2015'))  [["team_id", 16]]
SELECT COUNT(*) FROM "contracts"  WHERE "contracts"."team_id" = $1 AND (year IN ('2014-2015'))  [["team_id", 16]]
---
            }
        },
         series: [{
            name: 'Teams',
            colorByPoint: true,
            data: [
            <% @chart.teams.each_with_index do |t, i| %>{
                name: '<%= t.abbr %>',
                y: <%= t.contracts.year(params[:year]).sum(:salary).floor %>,
                drilldown: '<%= t.abbr %>'
            }<% if i != @chart.teams.size - 1 %>,<% end %>
            <%end%>
            ]
        }],


SELECT  "players".* FROM "players"  WHERE "players"."id" = $1 LIMIT 1  [["id", 221]]
---
		        duration: 500
		    },
            series: [
            <% @chart.teams.each_with_index do |t, i| %>{
                id: '<%= t.abbr %>',
                type: '<%= @chart.drill_chart %>',
                data:[
                <% t.contracts.year(params[:year]).each_with_index do |c, ix| %>
                	["<%== c.player.name%>", <%=c.salary.floor%>]<% if ix != t.contracts.size - 1 %>,<% end %>
                    <% end %>
                    ]

            }<% if i != @chart.teams.size - 1 %>,<% end %>
            <%end%>
            ]