app/views/shared/_search_form.html.erb

	<%= form_tag("/league_chart", method: "get") do %>
	  Compare All Team Salaries: <%= select_tag(:year, options_for_select(Contract.uniq.pluck(:year).sort, params[:year]))%>
---
SELECT DISTINCT "contracts"."year" FROM "contracts"

	<%= form_tag("/compare_chart", method: "get") do %>
	  Compare Two Teams Salaries: <%= select_tag(:team1, options_for_select(Team.uniq.pluck(:abbr).sort, params[:team1]))%>
---
SELECT DISTINCT "teams"."abbr" FROM "teams"