app/controllers/main_controller.rb

  def charts
    @contracts = Contract.year(params[:year])
    @team_data = Team.all.order(:abbr)
=begin
    @chart = LazyHighCharts::HighChart.new('graph') do |f|
      f.title(:text => "Salary By Team")
      f.xAxis(:categories => @team_data.map{|i| i.abbr})
      f.series(:name => "Salary", :yAxis => 0, :data => @team_data.map{|i| i.contracts.year(params[:year]).sum(:salary).floor }, :drilldown => 'subdept')
---
SELECT "contracts".* FROM "contracts"  WHERE (year IN ('2014-2015'))